;; -*- no-byte-compile: t; -*-
;;; ~/dotfiles/dots/emacs/doom/packages.el

;; feature/snippets
(package! yasnippet-snippets)

;; tools/tldr
(package! tldr)

;; Better folds
(package! origami)

(package! move-text)

;; Better window sizing
(package! golden-ratio)

(package! deft)
(package! zetteldeft)

(package! git-timemachine)
;; (use-package lsp-python-ms
;;   :ensure t
;;   :hook (python-mode . (lambda ()
                         ;; (require 'lsp-python-ms)
                         ;; (lsp))))
