jorgebucaran/fisher
jorgebucaran/fish-spin
jethrokuan/fzf
jethrokuan/z
franciscolourenco/done
fisherman/pipenv
edc/bass
rafaelrinaldi/pure
oh-my-fish/plugin-aws
evanlucas/fish-kubectl-completions
