;; -*- no-byte-compile: t; -*-
;;; ~/dotfiles/dots/emacs/doom/packages.el

;; ivy
(package! ivy-yasnippet)

(package! golden-ratio)

;; JS stuff
(package! prettier-js)
(package! pkgbuild-mode)

;; Fuzzy searching
(package! flx)

;; Filestuff
(package! ranger)

;; Better folds
(package! origami)
(package! move-text)

