;; -*- no-byte-compile: t; -*-
;;; ~/dotfiles/dots/emacs/doom/packages.el

;; completion/company
(package! prescient)
(package! company-prescient)

;; feature/snippets
(package! yasnippet-snippets)

;; lang/apache
(package! apache-mode)

;; lang/pkgbuild
(package! pkgbuild-mode)

;; lang/nginx
(package! nginx-mode)

;; lang/org
(package! ob-http)

;; lang/systemd
(package! systemd)

;; lang/sh
(package! flycheck-checkbashisms)

;; tools/tldr
(package! tldr)

;; JS stuff
(package! prettier-js)
(package! pkgbuild-mode)

;; Fuzzy searching
(package! flx)

;; Filestuff
(package! ranger)

;; Better folds
(package! origami)

(package! move-text)

;; Better window sizing
(package! golden-ratio)

;; ui/indent-guides
(package! highlight-indent-guides)
