jethrokuan/fzf
jethrokuan/z
jdxcode/gh
rominf/omf-plugin-hub
oh-my-fish/plugin-grc
oh-my-fish/plugin-node-binpath
oh-my-fish/plugin-sudope
oh-my-fish/plugin-bak
oh-my-fish/plugin-node
oh-my-fish/plugin-replace
oh-my-fish/plugin-vi-mode
jorgebucaran/fish-nvm
jorgebucaran/fish-spin
franciscolourenco/done
edc/bass
