tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'buo/cask-upgrade'
tap 'Schniz/tap'
tap 'd12frosted/emacs-plus'
tap 'crisidev/homebrew-chunkwm'

brew 'ack'
brew 'brew-cask-completion'

brew 'coreutils'
brew 'moreutils'
brew 'findutils', args: ['with-default-names']

brew 'cdiff'
brew 'curl', args: ['with-openssl']
brew 'ctags'
brew 'direnv'
brew 'duti'
brew 'emacs-plus'
brew 'ffmpeg'
brew 'fish'
brew 'fnm'
brew 'fzf'
brew 'gcc'
brew 'gdb'
brew 'git'
brew 'glib'
brew 'gnu-sed', args: ['with-default-names']
brew 'go'
brew 'gradle'
brew 'grep', args: ['with-default-names']
brew 'hub'
brew 'lua'
brew 'mas'
brew 'mongodb'
brew 'mysql'
brew 'nginx'
brew 'neovim/neovim/neovim'
brew 'openssl'
brew 'postgresql'
brew 'python@2'
brew 'python'
brew 'reattach-to-user-namespace'
brew 'source-highlight'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'urlview'
brew 'wget', args: ['with-iri']
brew 'youtube-dl'

brew 'chunkwm'
brew 'koekeishiya/formulae/skhd'

brew 'exa'
brew 'lsd'
brew 'htop'
brew 'httpie'
brew 'neofetch'
brew 'redis'
brew 'thefuck'
brew 'bat'
brew 'gnupg'
brew 'shpotify'
brew 'tldr'
brew 'ncdu'
brew 'tree'
brew 'yarn'

cask 'alfred'
cask 'bartender'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome-beta'
cask 'hammerspoon'
cask 'intellij-idea'
cask 'iterm2'
cask 'java11'
cask 'karabiner-elements'
cask 'little-snitch'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'

mas 'Amphetamine', id: 937984704
mas 'Shotty', id: 1250306151
mas 'Xcode', id: 497799835
