tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'buo/cask-upgrade'
tap 'Schniz/tap'
tap 'd12frosted/emacs-plus'

brew 'brew-cask-completion'
brew 'coreutils'
brew 'duti'
brew 'emacs-plus'
brew 'ffmpeg'
brew 'findutils', args: ['with-default-names']
brew 'fish'
brew 'fnm'
brew 'gcc'
brew 'gdb'
brew 'git'
brew 'glib'
brew 'gnu-sed', args: ['with-default-names']
brew 'go'
brew 'gradle'
brew 'hub'
# brew 'ipfs'
brew 'lua'
brew 'mas'
brew 'mongodb'
brew 'mysql'
brew 'nginx'
brew 'openssl'
brew 'postgresql'
brew 'python@2'
brew 'python'
brew 'source-highlight'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'wget', args: ['with-iri']
brew 'youtube-dl'

cask 'alfred'
cask 'bartender'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
# cask 'godot'
cask 'google-chrome'
cask 'hammerspoon'
cask 'intellij-idea'
cask 'iterm2'
cask 'java11'
cask 'karabiner-elements'
cask 'little-snitch'
# cask 'love'
# cask 'mac2imgur'
# cask 'mysqlworkbench'
# cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'steam'
# cask 'unity'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'

mas 'Amphetamine', id: 937984704
mas 'Shotty', id: 1250306151
mas 'Xcode', id: 497799835
