tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "clojure/tools"
# tap to install fnm
tap 'schniz/tap'
tap 'd12frosted/emacs-plus'
tap 'cloudtech/tap', 'git@github.pie.apple.com:cloudtech/homebrew-tap.git'
tap 'borkdude/brew'

brew 'ack'
brew 'brew-cask-completion'

brew 'coreutils'
brew 'moreutils'
brew 'findutils'

brew 'awscli'
brew 'curl'
brew 'ctags'
brew 'diff-so-fancy'
brew 'direnv'
brew 'findutils'
brew 'ffmpeg'
brew 'fish'
brew 'fnm'
brew 'fzf'
brew 'gcc'
brew 'git'
brew 'git-lfs'
brew 'grep'
brew 'glib'
brew 'gnu-sed'
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'mas'
brew 'openssl'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pkg-config'
brew 'postgresql'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'ripgrep'
brew 'reattach-to-user-namespace'
brew 'source-highlight'
brew 'sqlite'
brew 'ssh-copy-id', link: true
brew 'the_silver_searcher'
brew 'tmux'
brew 'urlview'
brew 'wget'
brew 'youtube-dl'

brew 'exa'
brew 'lsd'
brew 'htop'
brew 'httpie'
brew 'neofetch'
brew 'bat'
brew 'gnupg'
brew 'shpotify'
brew 'tldr'
brew 'ncdu'
brew 'tree'
brew 'zlib'

brew 'ccls'
brew 'clojure/tools/clojure'
brew 'borkdude/brew/babashka'
brew 'go'
brew 'node'
brew 'rust'
brew 'terraform'
brew 'mysql'
brew 'nginx'

brew 'cloudtech/tap/aws-session-manager-plugin'
brew 'cloudtech/tap/awsappleconnect'

brew 'emacs-plus'
brew 'neovim'

# to work with emacs
brew 'fd'
brew 'editorconfig'
brew 'pipenv'

cask 'alfred'
cask 'bartender'
cask 'brave-browser', args: { appdir: '/Applications' }
cask 'discord', args: { appdir: '/Applications' }
cask 'docker'
cask 'iterm2'
cask 'java11', args: { appdir: '/Applications' }
cask 'karabiner-elements', args: { appdir: '/Applications' }
cask 'spotify', args: { appdir: '/Applications' }
cask 'visual-studio-code', args: { appdir: '/Applications' }
cask 'vlc', args: { appdir: '/Applications' }
cask 'xquartz', args: { appdir: '/Applications' }

mas 'Be Focused Pro', id: 961632517
mas 'Fantastical', id: 975937182
mas 'Keynote', id: 409183694
mas 'Moom', id: 419330170
mas 'Shotty', id: 1250306151
mas 'Slack', id: 803453959
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
mas 'Xcode', id: 497799835
mas 'Logic Pro X', id: 634148309
